GREETING = "Привет! 👋 \n\nЯ подскажу расписание электричек."
INPUT_DEPARTURE_STATION = "Введите начальную станцию:"
INPUT_DESTINATION_STATION = "Введите конечную станцию:"
STATION_NOT_FOUND = "Такой станции не найдено. Попробуйте ввести по-другому."
MULTIPLE_STATIONS_FOUND = (
    "Было найдено несколько станций, удовлетворяющих вашему запросу. "
    "Выберите нужную станцию из списка ниже:"
)
MY_STATION_IS_NOT_HERE = "Нет моей станции 😕"
SEARCHING_FOR_TIMETABLE = (
    "Ищем раписание между станциями {departure_station} и {destination_station}..."
)
